app/controllers/authors_controller.rb

  def create
     @author = Author.new(author_params)
    if @author.save
---
INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Suzana', 'Scott', '2016-05-07 17:28:21', '2016-05-07 17:28:21')

  def update
    @author = Author.find(params[:id])
    @author.update(author_params)
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 3 LIMIT 1
UPDATE `authors` SET `last_name` = 'Cabrer', `updated_at` = '2016-05-10 14:19:30' WHERE `authors`.`id` = 3

  def edit
    @author = Author.find(params[:id])
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 3 LIMIT 1

  def index
    @authors = Author.all
---
SELECT `authors`.* FROM `authors`

  def show
    @author = Author.find(params[:id])
    @authors = Author.all
    @books = Book.all
    @categories = Category.all
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 3 LIMIT 1
SELECT `categories`.* FROM `categories`