app/controllers/books_controller.rb

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `title` = 'Ruby on Rails for Microsoft developers', `updated_at` = '2016-05-10 06:39:47' WHERE `books`.`id` = 1
---
  def update
  	@book = Book.find(params[:id])
  	@book.update(book_params)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def edit
  	@book = Book.find(params[:id])

SELECT `books`.* FROM `books`
SELECT `categories`.* FROM `categories`
---
  def index
  	@books = Book.all
	  @categories = Category.all

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`
---
  def show
  	@book = Book.find(params[:id])
  	@categories = Category.all