app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('PERL', '2016-05-07 15:54:10', '2016-05-07 15:54:10')

  def update
    @category = Category.find(params[:id])
    @category.update(category_params)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1
UPDATE `categories` SET `name` = 'JAVASCRIPT', `updated_at` = '2016-05-10 13:49:43' WHERE `categories`.`id` = 5

  def edit
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1

  def index
  @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def show
  @category = Category.find(params[:id])
  @categories = Category.all
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
SELECT `categories`.* FROM `categories`