app/controllers/publishers_controller.rb

  def create
     @publisher = Publisher.new(publisher_params)
    if @publisher.save
---
INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('Richmond illustrated ltd', '2016-05-07 16:37:54', '2016-05-07 16:37:54')

  def update
    @publisher = Publisher.find(params[:id])
    @publisher.update(publisher_params)
---
SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 1 LIMIT 1
UPDATE `publishers` SET `name` = 'Richmond & CO', `updated_at` = '2016-05-10 15:00:55' WHERE `publishers`.`id` = 1

  def edit
    @publisher = Publisher.find(params[:id])
---
SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 2 LIMIT 1

  def index
    @publishers = Publisher.all
---
SELECT `publishers`.* FROM `publishers`